In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(data = [[1,2,3],[2,3,4],[5,6,7]],columns=['c1','c2','c3'],index=['r1','r2','r3'])

In [3]:
df

    c1  c2  c3
r1   1   2   3
r2   2   3   4
r3   5   6   7

In [8]:
 df.reset_index()

  index  c1  c2  c3
0    r1   1   2   3
1    r2   2   3   4
2    r3   5   6   7

In [9]:
df.index

Index(['r1', 'r2', 'r3'], dtype='object')

(1) Multi Index

From tuples

In [24]:
arrays = [['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]

In [25]:
 tuples = list(zip(*arrays))

In [26]:
 ind = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [27]:
ind

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [28]:
ind.names

FrozenList(['first', 'second'])

(2) Multi-Indexing From iterables

In [29]:
iterables = [['bar', 'baz', 'foo', 'qux'], ['one', 'two']]

dff = pd.MultiIndex.from_product(iterables, names=['first', 'second'])

In [30]:
dff.names

FrozenList(['first', 'second'])

(3) Multiindexing from dataframes

In [33]:
dfd = pd.DataFrame([['bar', 'one'], ['bar', 'two'],['foo', 'one'], ['foo', 'two']],columns=['first', 'second'])

In [34]:
dfd

  first second
0   bar    one
1   bar    two
2   foo    one
3   foo    two

In [35]:
dfd.index

RangeIndex(start=0, stop=4, step=1)

In [36]:
dfd.columns

Index(['first', 'second'], dtype='object')

In [38]:
dfd.dtypes

first     object
second    object
dtype: object

Ordering Alpha Numeric data

In [44]:
import re 
l = ['AL13', 'AL3', 'AA14', 'AA4']    
sorted(l,key=lambda l:[int(i) if i.isdigit() else i for i in re.findall(r'[A-Za-z]+|\d+', l) if i])

['AA4', 'AA14', 'AL3', 'AL13']

In [45]:
sorted(l,key=lambda l:[int(i) if i.isdigit() else i for i in re.split(r'([A-Za-z]+)', l)])

['AA4', 'AA14', 'AL3', 'AL13']

In [46]:
dfd.describe

<bound method NDFrame.describe of   first second
0   bar    one
1   bar    two
2   foo    one
3   foo    two>

In [47]:
dfd

  first second
0   bar    one
1   bar    two
2   foo    one
3   foo    two

In [49]:
dfd.loc[1,:]

first     bar
second    two
Name: 1, dtype: object

In [50]:
dfd.loc[3,:]

first     foo
second    two
Name: 3, dtype: object

In [53]:
import numpy as np
df = pd.DataFrame(data=np.array([['Math','C1','S1',93],['Science','C2','S2',78]]),columns=['Subject','Class','Student','Max Marks'])

In [54]:
df

   Subject Class Student Max Marks
0     Math    C1      S1        93
1  Science    C2      S2        78

In [55]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [57]:
df.loc[1]

Subject      Science
Class             C2
Student           S2
Max Marks         78
Name: 1, dtype: object

In [58]:
df.loc[1].loc['Max Marks']

'78'

In [63]:
classIndex = pd.DataFrame(data = np.array([['Maths','S1','C1',98],['Science','S2','C2',90],['English','S3','C3',88]]),columns =['subject','section','class','Max_score'])

In [64]:
classIndex.index

RangeIndex(start=0, stop=3, step=1)

In [65]:
classIndex

   subject section class Max_score
0    Maths      S1    C1        98
1  Science      S2    C2        90
2  English      S3    C3        88

In [66]:
classIndex.loc[2]['Max_score']

'88'